Autodesk.Revit.DB.SolidSolidCutUtils.SplitFacesOfCuttingSolid(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element,System.Boolean)
Causes the faces of the cutting element where it intersects the element it is cutting to be split or unsplit.
Remarks:
There must be a cut between the input elements.
first:
The solid being cut or the cutting solid
second:
The solid being cut or the cutting solid
split:
True to split the faces of intersection, false to unsplit them.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no solid-solid cut between the input elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Unable to split or unsplit faces of cutting solid
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.CutExistsBetweenElements(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element,System.Boolean@)
Checks that if there is a solid-solid cut between two elements.
first:
The solid being cut or the cutting solid.
second:
The solid being cut or the cutting solid.
firstCutsSecond:
If the return value of this function is true, this indicates which element is the cutting element from the pair.
True if the first solid cuts the second one, false if the second solid cuts the first one.
Returns:
True if there is a solid-solid cut between the input elements, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.IsElementFromAppropriateContext(Autodesk.Revit.DB.Element)
Validates that the element is from an appropriate document.
Remarks:
Currently an element from either a project document, conceptual model, pattern based curtain panel, or adaptive component family
may participate in solid-solid cuts.
element:
The solid to be cut or the cutting solid.
Returns:
True if the element is from an appropriate document for solid-solid cuts, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.GetSolidsBeingCut(Autodesk.Revit.DB.Element)
Get all the solids which are cut by the input element.
element:
The input element.
Returns:
The ids of the solids which are cut by the input element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.GetCuttingSolids(Autodesk.Revit.DB.Element)
Gets all the solids which cut the input element.
element:
The input element.
Returns:
The ids of the solids which cut the input element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.CanElementCutElement(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.CutFailureReason@)
Verifies if the cutting element can add a solid cut to the target element.
cuttingElement:
The cutting element.
cutElement:
The element to be cut.
reason:
The reason that the cutting element cannot add a solid cut to the cut element.
Returns:
True if the cutting element can add a solid cut to the target element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.IsAllowedForSolidCut(Autodesk.Revit.DB.Element)
Validates that the element is eligible for a solid-solid cut.
Remarks:
The element must be solid and must be a GenericForm, GeomCombination, or a FamilyInstance.
element:
The solid to be cut or the cutting solid.
Returns:
True if the input element can participate in a solid-solid cut.  False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.RemoveCutBetweenSolids(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Removes the solid-solid cut between the two elements if it exists.
document:
The document containing the two elements
first:
The solid being cut or the cutting solid.
second:
The solid being cut or the cutting solid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.AddCutBetweenSolids(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element,System.Boolean)
Adds a solid-solid cut for the two elements with the option to control splitting of faces of the cutting solid.
document:
The document containing the two elements.
solidToBeCut:
The solid to be cut.
cuttingSolid:
The cutting solid.
splitFacesOfCuttingSolid:
True to split faces of cutting solid where it intersects the solid to be cut, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element must be in a project document or in a conceptual model, pattern based curtain panel, or adaptive component family.
-or-
The element does not meet the condition that it must be solid and must be a GenericForm, GeomCombination, or a FamilyInstance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to add solid-solid cut for the two elements.
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils.AddCutBetweenSolids(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Adds a solid-solid cut for the two elements.
Remarks:
This utility will split faces of cutting solid by default.
document:
The document containing the two elements.
solidToBeCut:
The solid to be cut.
cuttingSolid:
The cutting solid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element must be in a project document or in a conceptual model, pattern based curtain panel, or adaptive component family.
-or-
The element does not meet the condition that it must be solid and must be a GenericForm, GeomCombination, or a FamilyInstance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to add solid-solid cut for the two elements.
Since:
2011

Autodesk.Revit.DB.SolidSolidCutUtils
Exposes utilities which can cause one solid to cut another.
Remarks:
These utilities are applicable for the generic forms, geometry combinations and family instances in conceptual model,
pattern based curtain panel, or adaptive component families, and family instances which are permitted to participate in
joining in projects. Thus, for example, a beam cannot cut a wall (as the wall is not a family instance) in projects. Nor
can a steel beam participate in cutting another family (because steel beams do not participate in joining).
Since:
2011